[
  {
    "bookId": 1,
    "bookName": "To Kill a Mockingbird",
    "author": "Harper Lee",
    "image": "https://imgbb.host/images/3ZexV.jpeg",
    "review": "A classic novel that explores themes of racial injustice and moral growth. Harper Lee's 'To Kill a Mockingbird' is a timeless masterpiece that resonates with readers of all ages. Set in the fictional town of Maycomb, Alabama, during the 1930s, the story follows young Scout Finch as she navigates the complexities of race, class, and morality. Through the trial of Tom Robinson, a black man accused of raping a white woman, Lee exposes the deep-seated prejudices and inequalities ingrained in Southern society. With its powerful portrayal of courage, compassion, and integrity, 'To Kill a Mockingbird' continues to provoke thought and inspire change, reminding us of the importance of empathy and justice in our world.",
    "totalPages": 336,
    "rating": 4.5,
    "category": "Fiction",
    "tags": ["Classic", "Legal Drama", "Coming of Age"],
    "publisher": "J. B. Lippincott & Co.",
    "yearOfPublishing": 1960
  },
  {
    "bookId": 2,
    "bookName": "1984",
    "author": "George Orwell",
    "image": "https://imgbb.host/images/3ZYuu.jpeg",
    "review": "A dystopian masterpiece depicting a totalitarian regime and its impact on individuals. George Orwell's '1984' is a chilling portrayal of a future society ruled by omnipresent surveillance, thought control, and propaganda. Set in the fictional superstate of Oceania, the novel follows Winston Smith, a low-ranking Party member who rebels against the oppressive regime led by Big Brother. As Winston navigates a world where truth is relative and dissent is punishable by death, Orwell raises profound questions about the nature of power, freedom, and truth. '1984' remains a cautionary tale against authoritarianism and serves as a stark warning about the dangers of unchecked government control.",
    "totalPages": 328,
    "rating": 4.6,
    "category": "Dystopian Fiction",
    "tags": ["Dystopia", "Political Satire", "Totalitarianism"],
    "publisher": "Secker & Warburg",
    "yearOfPublishing": 1949
  },
  {
    "bookId": 3,
    "bookName": "The Great Gatsby",
    "author": "F. Scott Fitzgerald",
    "image": "https://imgbb.host/images/3Z0LB.jpeg",
    "review": "An exploration of the American Dream through the eyes of Jay Gatsby. F. Scott Fitzgerald's 'The Great Gatsby' is a captivating portrayal of the Roaring Twenties, a time of excess and disillusionment. Through the enigmatic figure of Jay Gatsby, a self-made millionaire with a mysterious past, Fitzgerald delves into the illusion of the American Dream and the emptiness of materialism. Set against the backdrop of lavish parties and extravagant lifestyles, the novel exposes the hollowness beneath the surface of wealth and privilege. With its lush prose and poignant themes of love, longing, and loss, 'The Great Gatsby' remains a timeless classic that continues to resonate with readers today.",
    "totalPages": 180,
    "rating": 4.3,
    "category": "Fiction",
    "tags": ["Roaring Twenties", "Romance", "Wealth"],
    "publisher": "Charles Scribner's Sons",
    "yearOfPublishing": 1925
  },
  {
    "bookId": 4,
    "bookName": "Pride and Prejudice",
    "author": "Jane Austen",
    "image": "https://imgbb.host/images/3ZBp7.jpeg",
    "review": "A classic romance novel exploring societal norms and love. Jane Austen's 'Pride and Prejudice' is a timeless tale of love, wit, and social commentary. Set in Regency-era England, the novel follows the spirited Elizabeth Bennet as she navigates the intricacies of courtship and marriage in a society governed by strict rules and expectations. Through Elizabeth's journey of self-discovery and her tumultuous relationship with the aloof Mr. Darcy, Austen explores themes of class, prejudice, and the pursuit of happiness. With its sharp wit, memorable characters, and timeless romance, 'Pride and Prejudice' remains a classic that continues to resonate with readers worldwide.",
    "totalPages": 432,
    "rating": 4.4,
    "category": "Romance",
    "tags": ["Romance", "Regency Era", "Social Commentary"],
    "publisher": "T. Egerton, Whitehall",
    "yearOfPublishing": 1813
  },
  {
    "bookId": 5,
    "bookName": "The Catcher in the Rye",
    "author": "J.D. Salinger",
    "image": "https://imgbb.host/images/3ZogK.webp",
    "review": "A coming-of-age novel capturing the disillusionment of youth. J.D. Salinger's 'The Catcher in the Rye' is a seminal work of American literature that continues to resonate with readers of all ages. Narrated by the disillusioned teenager Holden Caulfield, the novel follows his journey through New York City after being expelled from prep school. As Holden grapples with themes of identity, alienation, and authenticity, Salinger offers a poignant portrayal of adolescent angst and rebellion. With its candid voice and timeless themes, 'The Catcher in the Rye' remains a classic bildungsroman that speaks to the universal experience of growing up.",
    "totalPages": 224,
    "rating": 4.2,
    "category": "Fiction",
    "tags": ["Coming of Age", "Alienation", "Youth Culture"],
    "publisher": "Little, Brown and Company",
    "yearOfPublishing": 1951
  },
  {
    "bookId": 6,
    "bookName": "The Hobbit",
    "author": "J.R.R. Tolkien",
    "image": "https://imgbb.host/images/3ZUx9.jpeg",
    "review": "A fantasy adventure following Bilbo Baggins on an epic quest. J.R.R. Tolkien's 'The Hobbit' is a timeless tale of adventure, heroism, and friendship that continues to captivate readers of all ages. Set in the fictional world of Middle-earth, the novel follows the reluctant hobbit Bilbo Baggins as he embarks on a quest to reclaim the Lonely Mountain and its treasure from the fearsome dragon Smaug. Along the way, Bilbo encounters trolls, elves, goblins, and a mysterious creature named Gollum, testing his courage and resourcefulness at every turn. With its richly imagined world and unforgettable characters, 'The Hobbit' is a literary masterpiece that has inspired generations.",
    "totalPages": 310,
    "rating": 4.8,
    "category": "Fantasy",
    "tags": ["Fantasy", "Adventure", "Quest"],
    "publisher": "George Allen & Unwin",
    "yearOfPublishing": 1937
  },
  {
    "bookId": 7,
    "bookName": "To the Lighthouse",
    "author": "Virginia Woolf",
    "image": "https://imgbb.host/images/3ZX3e.jpeg",
    "review": "A modernist novel exploring the complexities of human relationships. Virginia Woolf's 'To the Lighthouse' is a groundbreaking work of modernist fiction that challenges traditional narrative conventions and explores the nuances of human consciousness. Set on the Isle of Skye in Scotland, the novel follows the Ramsay family and their guests as they navigate the passage of time, memory, and the shifting dynamics of family life. Through Woolf's innovative stream-of-consciousness technique, the novel delves into the inner thoughts and perceptions of its characters, offering profound insights into the nature of identity, connection, and artistic creation. With its lyrical prose and existential themes, 'To the Lighthouse' remains a timeless exploration of the human experience.",
    "totalPages": 209,
    "rating": 4.1,
    "category": "Modernist Fiction",
    "tags": ["Modernism", "Stream of Consciousness", "Family Dynamics"],
    "publisher": "The Hogarth Press",
    "yearOfPublishing": 1927
  },
  {
    "bookId": 8,
    "bookName": "One Hundred Years of Solitude",
    "author": "Gabriel Garcia Marquez",
    "image": "https://imgbb.host/images/3ZE62.jpeg",
    "review": "A magical realist novel chronicling the Buendía family across generations. Gabriel Garcia Marquez's 'One Hundred Years of Solitude' is a mesmerizing tapestry of love, loss, and the cyclical nature of history. Set in the fictional town of Macondo in Colombia, the novel follows the Buendía family over seven generations, blending magical realism with political allegory. As the family grapples with war, revolution, and the passage of time, Marquez creates a vivid and enchanting world filled with unforgettable characters and surreal events. With its lush prose and sprawling narrative, 'One Hundred Years of Solitude' is a timeless masterpiece that continues to captivate readers around the world.",
    "totalPages": 417,
    "rating": 4.7,
    "category": "Magic Realism",
    "tags": ["Magical Realism", "Latin American Literature", "Family Saga"],
    "publisher": "Harper & Row",
    "yearOfPublishing": 1967
  },
  {
    "bookId": 9,
    "bookName": "The Lord of the Rings",
    "author": "J.R.R. Tolkien",
    "image": "https://imgbb.host/images/3Z9yt.jpeg",
    "review": "An epic fantasy trilogy following the quest to destroy the One Ring. J.R.R. Tolkien's 'The Lord of the Rings' is a timeless epic that transports readers to the enchanting world of Middle-earth. Set against the backdrop of a cosmic struggle between good and evil, the novel follows Frodo Baggins and a fellowship of companions as they embark on a perilous journey to destroy the One Ring and defeat the dark lord Sauron. Along the way, they encounter fantastical creatures, epic battles, and moral dilemmas that test their courage and resolve. With its richly detailed mythology and universal themes of friendship, sacrifice, and redemption, 'The Lord of the Rings' continues to inspire readers of all ages.",
    "totalPages": 1216,
    "rating": 4.9,
    "category": "Fantasy",
    "tags": ["Epic Fantasy", "Adventure", "Quest"],
    "publisher": "Allen & Unwin",
    "yearOfPublishing": 1954
  },
  {
    "bookId": 10,
    "bookName": "Crime and Punishment",
    "author": "Fyodor Dostoevsky",
    "image": "https://imgbb.host/images/3Zyek.png",
    "review": "A psychological thriller exploring morality, guilt, and redemption. Fyodor Dostoevsky's 'Crime and Punishment' is a gripping tale of crime, punishment, and psychological torment. Set in St. Petersburg, Russia, the novel follows the impoverished student Raskolnikov as he grapples with his moral conscience after committing a heinous crime. As Raskolnikov becomes increasingly consumed by guilt and paranoia, he embarks on a harrowing journey of self-discovery and redemption, ultimately finding solace in the power of love and forgiveness. With its complex characters, philosophical depth, and moral ambiguity, 'Crime and Punishment' remains a cornerstone of world literature and a timeless exploration of the human condition.",
    "totalPages": 545,
    "rating": 4.6,
    "category": "Philosophical Fiction",
    "tags": ["Psychological Thriller", "Morality", "Guilt"],
    "publisher": "The Russian Messenger",
    "yearOfPublishing": 1866
  }
  ]
  